import React, { FC, useState } from 'react'
import classes from './StoriesBar.module.scss';
import Story from './Story/Story';
import { IStory } from './../../../../types/types';

interface IStoriesBar {
    stories: IStory[]
}

const StoriesBar: FC<IStoriesBar> = ({stories}) => {
    const [lengthScale, setLengthScale] = useState<number>(0)
    const [scrollCount, setscrollCount] = useState<number>(8)

    return (
        <div className={classes.StoriesBar}>
            {lengthScale !== 0 && 
                <div className={classes.GoToLeft} 
                    onClick={() => {
                        setLengthScale(lengthScale - 132); setscrollCount(scrollCount - 1)
                    }}>
                    <svg width="15" height="20" viewBox="0 0 15 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M8.96908 1.09494C8.86997 0.576297 8.51511 0.139216 8.10503 0.0306535C7.8597 -0.0342727 7.62645 0.00350594 7.38007 0.148133C7.24258 0.228833 7.02241 0.501999 3.73768 4.6674C1.81486 7.10574 0.211191 9.16058 0.173976 9.2337C-0.0338467 9.64201 -0.0569454 10.1674 0.112582 10.6296C0.176431 10.8037 0.399789 11.0937 3.67345 15.2529C5.59445 17.6936 7.21331 19.7291 7.27092 19.7764C7.71111 20.1374 8.28881 20.0546 8.66535 19.5767C9.01483 19.1331 9.09583 18.5276 8.88359 17.9453C8.82013 17.7711 8.62604 17.5183 5.7624 13.8802L2.70888 10.0009L5.7624 6.12164C8.62604 2.48357 8.82013 2.2308 8.88359 2.0566C9.0001 1.73688 9.02921 1.40954 8.96908 1.09494Z" fill="white"/><path fillRule="evenodd" clipRule="evenodd" d="M14.9691 1.09494C14.87 0.576297 14.5151 0.139216 14.105 0.0306535C13.8597 -0.0342727 13.6265 0.00350594 13.3801 0.148133C13.2426 0.228833 13.0224 0.501999 9.73768 4.6674C7.81486 7.10574 6.21119 9.16058 6.17398 9.2337C5.96615 9.64201 5.94305 10.1674 6.11258 10.6296C6.17643 10.8037 6.39979 11.0937 9.67345 15.2529C11.5944 17.6936 13.2133 19.7291 13.2709 19.7764C13.7111 20.1374 14.2888 20.0546 14.6653 19.5767C15.0148 19.1331 15.0958 18.5276 14.8836 17.9453C14.8201 17.7711 14.626 17.5183 11.7624 13.8802L8.70888 10.0009L11.7624 6.12164C14.626 2.48357 14.8201 2.2308 14.8836 2.0566C15.0001 1.73688 15.0292 1.40954 14.9691 1.09494Z" fill="white"/></svg>
                </div>
            }
            {( stories.length !== scrollCount && stories.length > 8 ) && 
                <div className={classes.GoToRight}
                    onClick={() => {
                        setLengthScale(lengthScale + 132);
                        setscrollCount(scrollCount + 1);
                    }}>
                    <svg width="15" height="20" viewBox="0 0 15 20" fill="none" xmlns="http://www.w3.org/2000/svg"><path fillRule="evenodd" clipRule="evenodd" d="M6.03092 18.9051C6.13003 19.4237 6.48489 19.8608 6.89497 19.9693C7.1403 20.0343 7.37355 19.9965 7.61993 19.8519C7.75742 19.7712 7.97759 19.498 11.2623 15.3326C13.1851 12.8943 14.7888 10.8394 14.826 10.7663C15.0338 10.358 15.0569 9.83264 14.8874 9.37038C14.8236 9.19629 14.6002 8.90627 11.3266 4.74707C9.40556 2.30641 7.78669 0.270865 7.72908 0.223627C7.28889 -0.137354 6.71119 -0.0545945 6.33465 0.423323C5.98517 0.866948 5.90417 1.47237 6.11641 2.05474C6.17987 2.22894 6.37396 2.4817 9.23761 6.11978L12.2911 9.99907L9.23761 13.8784C6.37396 17.5164 6.17987 17.7692 6.11641 17.9434C5.9999 18.2631 5.97079 18.5905 6.03092 18.9051Z" fill="white"/><path fillRule="evenodd" clipRule="evenodd" d="M0.0309234 18.9051C0.130028 19.4237 0.484888 19.8608 0.894973 19.9693C1.1403 20.0343 1.37355 19.9965 1.61993 19.8519C1.75742 19.7712 1.97759 19.498 5.26232 15.3326C7.18514 12.8943 8.78881 10.8394 8.82602 10.7663C9.03385 10.358 9.05695 9.83264 8.88742 9.37038C8.82357 9.19629 8.60021 8.90627 5.32655 4.74707C3.40556 2.30641 1.78669 0.270865 1.72908 0.223627C1.28889 -0.137354 0.711194 -0.0545945 0.334654 0.423323C-0.0148251 0.866948 -0.0958291 1.47237 0.116407 2.05474C0.179873 2.22894 0.373963 2.4817 3.23761 6.11978L6.29113 9.99907L3.23761 13.8784C0.373964 17.5164 0.179873 17.7692 0.116407 17.9434C-0.000100462 18.2631 -0.0292105 18.5905 0.0309234 18.9051Z" fill="white"/></svg>
                </div>
            }

            <div className={classes.Overflow}>
                <div className={classes.Bar} id='bar' style={{left: `-${lengthScale}px`}}>
                    {stories.map((story, id) => {
                        return <Story key={'storie'+id+'Gett'} story={story}/>
                    })}
                </div>
            </div>
            {/* передаю функцию истории которая принимает setOpen и объект контента истории, попап при open = true открывается и получает контент истории */}
        </div>
    )
}

export default StoriesBar